## Data Cleaning

In [35]:
# Import modules
import pandas as pd
from ast import literal_eval

### TMDB Data

In [161]:
# Load dataset
tmdb_df = pd.read_csv('../acquisition/tmdb_raw_data.csv')

In [162]:
tmdb_df.head()

,adult,backdrop_path,budget,genres,homepage,id,imdb_id,original_language,original_title,overview,...,vote_average,vote_count,belongs_to_collection.id,belongs_to_collection.name,belongs_to_collection.poster_path,belongs_to_collection.backdrop_path,belongs_to_collection,success,status_code,status_message
0,False,/3Rfvhy1Nl6sSGJwyjb0QiZzZYlB.jpg,30000000,"[{'id': 16, 'name': 'Animation'}, {'id': 12, '...",http://toystory.disney.com/toy-story,862,tt0114709,en,Toy Story,"Led by Woody, Andy's toys live happily in his ...",...,7.965,16207,10194.0,Toy Story Collection,/7G9915LfUQ2lVfwMEEhDsn3kT4B.jpg,/9FBwqcd9IRruEDUrTdcaafOMKUq.jpg,NaN,NaN,NaN,NaN
1,False,/pYw10zrqfkdm3yD9JTO6vEGQhKy.jpg,65000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",http://www.sonypictures.com/movies/jumanji/,8844,tt0113497,en,Jumanji,When siblings Judy and Peter discover an encha...,...,7.200,9368,495527.0,Jumanji Collection,/6sjMsBcIuqU44GpG5tL33KUFOQR.jpg,/9PCsWrw1GvrZkrd1GCxRqscgZu0.jpg,NaN,NaN,NaN,NaN
2,False,/1J4Z7VhdAgtdd97nCxY7dcBpjGT.jpg,25000000,"[{'id': 10749, 'name': 'Romance'}, {'id': 35, ...",NaN,15602,tt0113228,en,Grumpier Old Men,A family wedding reignites the ancient feud be...,...,6.441,316,119050.0,Grumpy Old Men Collection,/nLvUdqgPgm3F85NMCii9gVFUcet.jpg,/hypTnLot2z8wpFS7qwsQHW1uV8u.jpg,NaN,NaN,NaN,NaN
3,False,/jZjoEKXMTDoZAGdkjhAdJaKtXSN.jpg,16000000,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",NaN,31357,tt0114885,en,Waiting to Exhale,"Cheated on, mistreated and stepped on, the wom...",...,6.300,128,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,False,/lEsjVrGU21BeJjF5AF9EWsihDpw.jpg,0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10751, '...",NaN,11862,tt0113041,en,Father of the Bride Part II,Just when George Banks has recovered from his ...,...,6.228,621,96871.0,Father of the Bride (Steve Martin) Collection,/nts4iOmNnq7GNicycMJ9pSAn204.jpg,/7qwE57OVZmMJChBpLEbJEmzUydk.jpg,NaN,NaN,NaN,NaN

In [163]:
tmdb_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9626 entries, 0 to 9625
Data columns (total 32 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   adult                                9626 non-null   bool
 1   backdrop_path                        9371 non-null   object
 2   budget                               9626 non-null   int64
 3   genres                               9626 non-null   object
 4   homepage                             2516 non-null   object
 5   id                                   9626 non-null   int64
 6   imdb_id                              9626 non-null   object
 7   original_language                    9626 non-null   object
 8   original_title                       9626 non-null   object
 9   overview                             9616 non-null   object
 10  popularity                           9626 non-null   float64
 11  poster_path                          9606 non-null   object
 12  production_companies                 9626 non-null   object
 13  production_countries                 9626 non-null   object
 14  release_date                         9626 non-null   object
 15  revenue                              9626 non-null   int64
 16  runtime                              9626 non-null   int64
 17  spoken_languages                     9626 non-null   object
 18  status                               9626 non-null   object
 19  tagline                              7911 non-null   object
 20  title                                9626 non-null   object
 21  video                                9626 non-null   bool
 22  vote_average                         9626 non-null   float64
 23  vote_count                           9626 non-null   int64
 24  belongs_to_collection.id             2044 non-null   float64
 25  belongs_to_collection.name           2044 non-null   object
 26  belongs_to_collection.poster_path    1994 non-null   object
 27  belongs_to_collection.backdrop_path  1830 non-null   object
 28  belongs_to_collection                0 non-null      float64
 29  success                              0 non-null      float64
 30  status_code                          0 non-null      float64
 31  status_message                       0 non-null      float64
dtypes: bool(2), float64(7), int64(5), object(18)
memory usage: 2.2+ MB

In [164]:
tmdb_df = tmdb_df[['original_title','imdb_id','genres','release_date','revenue','runtime','vote_average']]

In [165]:
tmdb_df.head()

,original_title,imdb_id,genres,release_date,revenue,runtime,vote_average
0,Toy Story,tt0114709,"[{'id': 16, 'name': 'Animation'}, {'id': 12, '...",1995-10-30,373554033,81,7.965
1,Jumanji,tt0113497,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",1995-12-15,262821940,104,7.200
2,Grumpier Old Men,tt0113228,"[{'id': 10749, 'name': 'Romance'}, {'id': 35, ...",1995-12-22,71500000,101,6.441
3,Waiting to Exhale,tt0114885,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",1995-12-22,81452156,127,6.300
4,Father of the Bride Part II,tt0113041,"[{'id': 35, 'name': 'Comedy'}, {'id': 10751, '...",1995-12-08,76594107,106,6.228

In [166]:
# converting the genres column to be a string from a list so that it can be exploded
tmdb_df['genres'] = tmdb_df['genres'].apply(literal_eval)

In [168]:
tmdb_df.head()

,original_title,imdb_id,genres,release_date,revenue,runtime,vote_average
0,Toy Story,tt0114709,"[{'id': 16, 'name': 'Animation'}, {'id': 12, '...",1995-10-30,373554033,81,7.965
1,Jumanji,tt0113497,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",1995-12-15,262821940,104,7.200
2,Grumpier Old Men,tt0113228,"[{'id': 10749, 'name': 'Romance'}, {'id': 35, ...",1995-12-22,71500000,101,6.441
3,Waiting to Exhale,tt0114885,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",1995-12-22,81452156,127,6.300
4,Father of the Bride Part II,tt0113041,"[{'id': 35, 'name': 'Comedy'}, {'id': 10751, '...",1995-12-08,76594107,106,6.228

In [169]:
genres = tmdb_df.explode('genres')

In [170]:
genres

,original_title,imdb_id,genres,release_date,revenue,runtime,vote_average
0,Toy Story,tt0114709,"{'id': 16, 'name': 'Animation'}",1995-10-30,373554033,81,7.965
0,Toy Story,tt0114709,"{'id': 12, 'name': 'Adventure'}",1995-10-30,373554033,81,7.965
0,Toy Story,tt0114709,"{'id': 10751, 'name': 'Family'}",1995-10-30,373554033,81,7.965
0,Toy Story,tt0114709,"{'id': 35, 'name': 'Comedy'}",1995-10-30,373554033,81,7.965
1,Jumanji,tt0113497,"{'id': 12, 'name': 'Adventure'}",1995-12-15,262821940,104,7.200
...,...,...,...,...,...,...,...
9624,文豪ストレイドッグス DEAD APPLE,tt8391976,"{'id': 35, 'name': 'Comedy'}",2018-03-03,0,90,8.200
9624,文豪ストレイドッグス DEAD APPLE,tt8391976,"{'id': 9648, 'name': 'Mystery'}",2018-03-03,0,90,8.200
9624,文豪ストレイドッグス DEAD APPLE,tt8391976,"{'id': 80, 'name': 'Crime'}",2018-03-03,0,90,8.200
9624,文豪ストレイドッグス DEAD APPLE,tt8391976,"{'id': 14, 'name': 'Fantasy'}",2018-03-03,0,90,8.200
9625,Andrew Dice Clay: Dice Rules,tt0101726,"{'id': 35, 'name': 'Comedy'}",1991-05-17,0,85,6.500

In [171]:
genres = genres['genres'].apply(pd.Series)

In [172]:
genres.head(10)

        id       name   0
0     16.0  Animation NaN
0     12.0  Adventure NaN
0  10751.0     Family NaN
0     35.0     Comedy NaN
1     12.0  Adventure NaN
1     14.0    Fantasy NaN
1  10751.0     Family NaN
2  10749.0    Romance NaN
2     35.0     Comedy NaN
3     35.0     Comedy NaN

In [173]:
genres.drop(columns='id', inplace=True)
genres = genres.iloc[:, :-1]
genres.rename(columns={'name':'genre'}, inplace=True)

In [174]:
genres.head(10)

       genre
0  Animation
0  Adventure
0     Family
0     Comedy
1  Adventure
1    Fantasy
1     Family
2    Romance
2     Comedy
3     Comedy

In [178]:
# want to make the genre concat across rows (horizontally) instead of down the columns like here
pd.merge(tmdb_df, genres, left_index=True, right_index=True)

,original_title,imdb_id,genres,release_date,revenue,runtime,vote_average,genre
0,Toy Story,tt0114709,"[{'id': 16, 'name': 'Animation'}, {'id': 12, '...",1995-10-30,373554033,81,7.965,Animation
0,Toy Story,tt0114709,"[{'id': 16, 'name': 'Animation'}, {'id': 12, '...",1995-10-30,373554033,81,7.965,Adventure
0,Toy Story,tt0114709,"[{'id': 16, 'name': 'Animation'}, {'id': 12, '...",1995-10-30,373554033,81,7.965,Family
0,Toy Story,tt0114709,"[{'id': 16, 'name': 'Animation'}, {'id': 12, '...",1995-10-30,373554033,81,7.965,Comedy
1,Jumanji,tt0113497,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",1995-12-15,262821940,104,7.200,Adventure
...,...,...,...,...,...,...,...,...
9624,文豪ストレイドッグス DEAD APPLE,tt8391976,"[{'id': 16, 'name': 'Animation'}, {'id': 28, '...",2018-03-03,0,90,8.200,Comedy
9624,文豪ストレイドッグス DEAD APPLE,tt8391976,"[{'id': 16, 'name': 'Animation'}, {'id': 28, '...",2018-03-03,0,90,8.200,Mystery
9624,文豪ストレイドッグス DEAD APPLE,tt8391976,"[{'id': 16, 'name': 'Animation'}, {'id': 28, '...",2018-03-03,0,90,8.200,Crime
9624,文豪ストレイドッグス DEAD APPLE,tt8391976,"[{'id': 16, 'name': 'Animation'}, {'id': 28, '...",2018-03-03,0,90,8.200,Fantasy
9625,Andrew Dice Clay: Dice Rules,tt0101726,"[{'id': 35, 'name': 'Comedy'}]",1991-05-17,0,85,6.500,Comedy

In [92]:
tmdb_df = pd.concat([tmdb_df.drop(['genres'], axis=1), tmdb_df['genres'].apply(pd.Series)], axis=1)

In [93]:
tmdb_df.drop(columns='id', inplace=True)

In [94]:
tmdb_df = tmdb_df.iloc[:, :-1]

In [95]:
tmdb_df.rename(columns={'original_title':'title', 'name':'genre'}, inplace=True)

In [96]:
tmdb_df

,title,imdb_id,release_date,revenue,runtime,vote_average,genre
0,Toy Story,tt0114709,1995-10-30,373554033,81,7.965,Animation
0,Toy Story,tt0114709,1995-10-30,373554033,81,7.965,Adventure
0,Toy Story,tt0114709,1995-10-30,373554033,81,7.965,Family
0,Toy Story,tt0114709,1995-10-30,373554033,81,7.965,Comedy
1,Jumanji,tt0113497,1995-12-15,262821940,104,7.200,Adventure
...,...,...,...,...,...,...,...
9624,文豪ストレイドッグス DEAD APPLE,tt8391976,2018-03-03,0,90,8.200,Comedy
9624,文豪ストレイドッグス DEAD APPLE,tt8391976,2018-03-03,0,90,8.200,Mystery
9624,文豪ストレイドッグス DEAD APPLE,tt8391976,2018-03-03,0,90,8.200,Crime
9624,文豪ストレイドッグス DEAD APPLE,tt8391976,2018-03-03,0,90,8.200,Fantasy
9625,Andrew Dice Clay: Dice Rules,tt0101726,1991-05-17,0,85,6.500,Comedy